Documents/ро_ПриходОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ро_ПриходОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстатокРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТНвходящий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрИдентификаторСкладаR3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефоныПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопроводительныеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролерСТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОбработкиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Comment>-</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОборудования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокЗаказНаряд</Name>
							<Comment>-</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСкладаR3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_ИдентификаторСкладаЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборудованиеПримечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>масса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДокументовДЛяПечФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДокументовДЛяПечФорм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реестр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испытания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДефВедомость</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ро_Отгрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ро_Отгрузка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстатокРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефоныПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопроводительныеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролерСТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОбработкиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказНаряды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ро_ПриходОборудования/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем начТекущаяДата;

&НаКлиенте
Процедура ОборудованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
	Элемент.ТекущиеДанные.ДокЗаказНаряд = Неопределено;
	КонецЕСЛИ;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКарточки(Команда)
	Если ОбщийКлиент.ПроверкаМодифицированности(ЭтаФорма,команда)=Ложь Тогда Возврат; КонецЕсли;
	Таб = ПечатьКарточкиНаСервере(Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,"Карточки"),,Новый УникальныйИдентификатор());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПечатьКарточкиНаСервере(сс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_ПриходОборудованияОборудования.ДокЗаказНаряд КАК ДокЗаказНаряд
	               |ИЗ
	               |	Документ.ро_ПриходОборудования.Оборудования КАК ро_ПриходОборудованияОборудования
	               |ГДЕ
	               |	ро_ПриходОборудованияОборудования.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ссылка",сс);
	ТБл = Запрос.Выполнить().Выгрузить();
	// Вставить содержимое обработчика.
	Возврат Документы.роЗаказНаряд.ПечатьКарточки(Тбл.ВыгрузитьКолонку("ДокЗаказНаряд"));
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивИзСсылки(сс)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_ПриходОборудованияОборудования.ДокЗаказНаряд КАК ДокЗаказНаряд
	               |ИЗ
	               |	Документ.ро_ПриходОборудования.Оборудования КАК ро_ПриходОборудованияОборудования
	               |ГДЕ
	               |	ро_ПриходОборудованияОборудования.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",сс);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокЗаказНаряд");
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.лог = ""+ТекущаяДата()+"-"+ИмяПользователя()+"-"+ИмяКомпьютера();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МасСс = ПолучитьМассивИзСсылки(Объект.Ссылка);
		Для каждого Стр из Объект.Оборудования Цикл
			п = масСС.НАйти(Стр.ДокЗаказНаряд);
			Если п=Неопределено ТОгда
				массс.Добавить(1);
				прервать;
			КонецЕСЛИ;
			массс.удалить(п);
		Конеццикла;
		ЕстьИзменения = масСС.Количество()<>0;
	ИНаче
		ЕстьИзменения=Истина;
		ВремяОбработкиДокумента = 0;
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		Объект.ВремяОбработкиДокумента = Объект.ВремяОбработкиДокумента + (ТекущаяДата()-начТекущаяДата);
		начТекущаяДата = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ОборудованияДокЗаказНарядНомер" Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ДокЗаказНаряд);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере(ЕстьИзмПрефикса=Ложь)
	
	Справочники.ПечатныеФормы.ДобавитьКнопкиПечати(ЭтаФорма,Объект.Контрагент,Перечисления.ВидыДокументовДЛяПечФорм.Приход);
	
	префиксКА=СокрЛП(Объект.Контрагент.Префикс);
	длПРеф = СтрДлина(префиксКА);
	Если длПРеф>0 Тогда
		Для каждого Стр из Объект.Оборудования Цикл
			Если ЗначениеЗаполнено(Стр.ДокЗаказНаряд)=Ложь ТОгда Продолжить; КонецЕслИ;
			Если Лев(Стр.ДокЗаказНаряд.Номер,длПРеф)<>ПрефиксКА Тогда
				Есть=Истина;
				прервать;
			КонецеСЛИ;
		КонецЦикла;
	КонецЕСЛИ;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Контрагент_Реквизиты(сс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.ПунктПогрузки КАК ПунктПогрузки,
	               |	Контрагенты.Подписант КАК Подписант,
	               |	Контрагенты.ПодписантДолжность КАК ПодписантДолжность
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Сс);
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Стк = Новый Структура;
	Для каждого Кол из ТБл.Колонки Цикл
		Стк.вставить(Кол.имя,ТБл[0][Кол.имя]);
	Конеццикла;
	
	
	Возврат Стк;
	
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбновитьВидимость();
	ЕстьИзмПрефикса=Ложь;
	КонтрагентПриИзмененииНаСервере(ЕстьИзмПрефикса);
	Стк = Контрагент_Реквизиты(Объект.Контрагент);
	Если ЗначениеЗаполнено(Объект.ПунктПогрузки)=ложь Тогда
		Объект.ПунктПогрузки = Стк.ПунктПогрузки;
	КонецЕСЛИ;
	Объект.Подписант = Стк.Подписант;
	Объект.ПодписантДолжность = Стк.ПодписантДолжность;
	
	Если ЕстьИзмПрефикса Тогда
		 ОбновитьНумерациюЗаказНарядов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМасКолонок(КА,Мас)
	Рез =новый Массив; 
	
	Если ЗначениеЗаполнено(КА)=Ложь Тогда Возврат Рез; КонецЕСлИ;
	стрКА = нрег(КА.КолонкиСкрытыеПриход);
	
	Для каждого эл из Мас Цикл
		п = нрег(Эл);
		п = СтрЗаменить(п,"оборудования","");
		Если НАйти(стрКА,","+п+",")<>0 Тогда
			Рез.Добавить(эл);
		КонецЕсли;
	КонецЦикла;
	
	 Возврат Рез;
	
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимость()
	
	Мас = Новый Массив;
	Для каждого эл из Элементы.Оборудования.ПодчиненныеЭлементы Цикл
		Мас.Добавить(эл.имя);
	КонецЦикла;
	Рез = ПолучитьМасКолонок(Объект.Контрагент,Мас);
	Для каждого Эл из Рез Цикл
		Элементы[эл].Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
	
	начТекущаяДата = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПЛ(Команда)
	открытьФорму("Документ.ро_Отгрузка.Форма.ФормаЗагрузкаПЛ",,ЭтаФорма,ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НасервереБезКонтекста
Функция ПечатныеФормыНаСервере(ссДок,Имя)
	Если ЗначениеЗаполнено(ссДОк)=Ложь Тогда Возврат Неопределено; КонецЕсли; 
	
	Если Имя = "ТТН" Тогда
		имя = Имя+" "+ссДок.Номер;
		Возврат Документы.ро_Отгрузка.ПечатьТТН(ссДок);
	ИНАче
		Возврат Справочники.ПечатныеФормы.ПечатьПоКодуФормы(ссДок,Имя);
	КонецЕСЛИ;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда) Экспорт
	
	Если ОбщийКлиент.ПроверкаМодифицированности(ЭтаФорма,команда)=Ложь Тогда Возврат; КонецЕсли;
	
	ИмяКодМакета = СокрЛП(Команда.Имя);
	Таб = ПечатныеФормыНаСервере(Объект.Ссылка,ИмяКодМакета);
	Если Таб = Неопределено Тогда Возврат; КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,ИмяКодМакета),,Новый УникальныйИдентификатор());
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьТТН(Команда) Экспорт
	
	Если ОбщийКлиент.ПроверкаМодифицированности(ЭтаФорма,команда)=Ложь Тогда Возврат; КонецЕсли;
	
	ИмяКодМакета = СокрЛП(Команда.Имя);
	Таб = ПечатныеФормыНаСервере(Объект.Ссылка,ИмяКодМакета);
	Если Таб = Неопределено Тогда Возврат; КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,ИмяКодМакета),,Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНумерациюЗаказНарядов(Команда=Неопределено)
	
	оо = Новый ОписаниеОповещения("ОтветНаОбновитьНумерацию",ЭтотОбъект);
	ПоказатьВопрос(оо,"Заказ-нарядам будут присвоены новые номера. Продолжить?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура  ОтветНаОбновитьНумерацию(Рез,Пар) Экспорт
	Если Рез<>КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	Мас = новый Массив;
	Для каждого Стр из Объект.Оборудования Цикл 
		Мас.Добавить(Стр.ДокЗаказНаряд);
	КонецЦикла;	
	ОбновитьНумерациюЗаказНарядовНаСервере(Мас,Объект.Контрагент);
	
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Оборудования);
	
КонецПроцедуры

&НасервереБезКонтекста
Процедура ОбновитьНумерациюЗаказНарядовНаСервере(Мас,ссКА)
	префиксКА=СокрЛП(ссКА.Префикс);
	длПРеф = СтрДлина(префиксКА);
	
	Для каждого Эл из Мас ЦИкл
		Если ЗначениеЗаполнено(ЭЛ)=ложь Тогда Продолжить; КонецЕсли;
		Обк = Эл.ПолучитьОбъект();
		
		Если Лев(Обк.Номер,длПРеф)=ПрефиксКА Тогда Продолжить; КонецЕсли;
		
		Обк.Номер = "";
		Обк.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Если ЗначениеЗаполнено(Объект.Ссылка)=Ложь ТОгда
		Для каждого Стр из Объект.Оборудования Цикл
			Стр.ДокЗаказНаряд = Неопределено;
		КонецЦикла;
	КонецЕсли;
	
	
	
КонецПроцедуры
